{
    "siteName": "InspireHub",
    "domain": "inspirehubdaily.com",
    "purpose": "To provide motivation and support for individuals interested in self-development through daily quotes, articles, personal challenges, and goal tracking.",
    "colors": {
      "background": "#E0F7FA",
      "header": "#004D40",
      "card": "#FFFFFF",
      "accent": "#FF9800"
    },
    "typography": {
      "body": "Roboto",
      "headings": "Playfair Display"
    },
    "scenarios": [
      "Where can I find motivational quotes and personal development content daily?",
      "How do I track my progress on a 30-day challenge or personal goal?",
      "Which book should I read next to boost my productivity and mindset?"
    ],
    "quotes": [
      "Believe you can and you're halfway there. — Theodore Roosevelt",
      "Act as if what you do makes a difference. It does. — William James",
      "Success is not how high you have climbed, but how you make a positive difference to the world. — Roy T. Bennett",
      "Happiness is not something ready made. It comes from your own actions. — Dalai Lama",
      "Don't watch the clock; do what it does. Keep going. — Sam Levenson",
      "Start where you are. Use what you have. Do what you can. — Arthur Ashe",
      "You are never too old to set another goal or to dream a new dream. — C.S. Lewis",
      "It always seems impossible until it’s done. — Nelson Mandela",
      "With the new day comes new strength and new thoughts. — Eleanor Roosevelt",
      "What lies behind us and what lies before us are tiny matters compared to what lies within us. — Ralph Waldo Emerson",
      "Keep your face always toward the sunshine—and shadows will fall behind you. — Walt Whitman",
      "Don’t limit your challenges. Challenge your limits. — Anonymous",
      "Push yourself, because no one else is going to do it for you. — Unknown",
      "Great things never come from comfort zones. — Anonymous",
      "Dream it. Wish it. Do it. — Anonymous"
    ]
  }
  